{ "__v" : 0, "_id" : { "$oid" : "510e5d9fac562f401c000002" }, "accepted" : false, "content" : "My research topic is Pythagoras, the great mathematician and philosopher. I will cover Pythagoras' journey from being a young boy to a respected man. There are many legends about Pythagoras, in particular the legend about how Pythagoras discovered a mathematical basis to music. Besides Pythagoras' theories on music, his famous theorem and love for mathematics changed the course of music and mathematics that following generations are built upon.", "email" : "fred@student.fitchburgstate.edu", "other_equipment" : "", "sponsor_dept" : "Biology/Chemistry", "sponsor_email" : "adlfaf", "sponsor_name" : "asdfadf", "sponsor_statement" : { "$binary" : "", "$type" : "00" }, "submit_date" : { "$date" : 1359895966020 }, "title" : "Handout13.mw", "type" : "Poster Presentation" }
{ "__v" : 0, "_id" : { "$oid" : "510f9532fc0425b11d000002" }, "accepted" : false, "content" : "The tax rate in the United States is highly subject to change, as is the amount of the federal deficit. The research examines how the individual income tax rate directly relates to the deficit. By giving a historical perspective over the years since income tax was first enacted and tracking the federal deficit over the same time period the correlation is illustrated. A comparison to the United States GDP (a standard measure of economic health) during these years shows what occurred historically when tax rates changed. Also presented are some of the social and cultural effects during periods when taxes are at a higher percentage of income vs. when they are comparatively low. This research provides insight into a very important issue that must be understood in an election year. Demonstrating facts and not getting caught up in political rhetoric will help inform voters, enabling them to have a more realistic view when it comes time to cast their ballot in November.", "email" : "fred@student.fitchburgstate.edu", "other_equipment" : "", "sponsor_dept" : "Business Administration", "sponsor_email" : "richard@fitchburgstate.edu", "sponsor_name" : "Richard desRoches", "sponsor_statement" : "", "submit_date" : { "$date" : 1359975727691 }, "title" : "Income Tax in the United States: A history of tax rates and their effect on the federal deficit and GDP", "type" : "Poster Presentation" }
{ "__v" : 0, "_id" : { "$oid" : "5110ec9fc654b0b344000001" }, "accepted" : false, "content" : "In early American literature, Native Americans were treated much as they were treated in reality: disrespected and underrepresented. In 1827, Catherine Sedgwick sought to change that by creating Magawisca, the Native American heroine of her book Hope Leslie. Both Magawisca and her relationships with the Massachusetts colonists are immensely complex. This relationship is mirrored in \"The Memorial of the Cherokee Council,\" a plea to Congress to delay Native American removal. Both Magawisca and the Cherokee recognize that their oppressors are valuable as friends. Magawisca bonds with her captors, the Fletchers, and the Cherokee describe themselves as children who benefit from the States' knowledge and civilization. The Cherokee name their long-standing loyalty to the US, as Magawisca aims to prevent a raid that would endanger the Fletchers. But there is a darker side to these relationships. The Cherokee are in danger of deportation, and their letter hints passive-aggressively at what may come should the US break their promises. Magawisca must choose between protecting the Fletchers and loyalty to her tribe. The relationships of Hope Leslie were indicative of changing literary times, but this discussion cannot be isolated to literature. The historical contexts of the novel (King Phillip's War) and the memorial (the Trail of Tears) are necessary to appreciate the complexities faced by both parties. And the outcomes of these loyalty dilemmas (both Magawisca and the United States choose their own interests) prove that community-based tensions are nearly impossible to resolve, as long as such divisions exist.", "email" : "grace@student.fitchburgstate.edu", "other_equipment" : "toaster", "sponsor_dept" : "English Studies", "sponsor_email" : "ben@fitchburgstate.edu", "sponsor_name" : "Ben Railton", "sponsor_statement" : "", "submit_date" : { "$date" : 1360063631917 }, "title" : "Native American Representation in Early American Literature: The Oppressed and the Oppressor", "type" : "Poster Presentation", "use_animal_subjects" : false, "use_human_subjects" : false }
{ "__v" : 0, "_id" : { "$oid" : "5116cc57aaba6dc578000002" }, "accepted" : false, "content" : "I studied natural history on 320 acres of town and conservation-owned land at my internship at the Cape Cod Museum of Natural History in Brewster, Massachusetts. Leaning more towards observational instead of experimental methods, I studied the plants and animals of the mudflats, woodlands, and salt marshes along the shore of Cape Cod Bay. I worked as a museum interpreter throughout the two floors of exhibits about the flora and fauna of Cape Cod. This included exhibits on coastal change, whales, indigenous birds, and in particular I worked in the aquaria at a mock tidal pool. I was trained as a naturalist, someone who takes groups of museumgoers on guided tours through the nature trails that connect the museum to the shore. In this presentation I will share my experience exploring, attending lectures and workshops, and aiding in the children's programs at the museum.", "email" : "grace@student.fitchburgstate.edu", "other_equipment" : "", "sponsor_dept" : "Biology & Chemistry", "sponsor_email" : "chris@fitchburgstate.edu", "sponsor_name" : "Chris Piccone", "sponsor_statement" : "", "submit_date" : { "$date" : 1360448585325 }, "title" : "How to be a Naturalist: My Experience at the Cape Cod Museum of Natural History", "type" : "Oral Presentation", "use_animal_subjects" : false, "use_human_subjects" : false }
